smartmeio/arancino-core-stm32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Smartme.IO STM32 Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Arancino V boards

ArancinoV.name=Arancino V
ArancinoV.build.core=arduino
ArancinoV.build.board=ArancinoV
ArancinoV.build.variant_h=variant_{build.board}.h
ArancinoV.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DUSEFREERTOS 


# ArancinoV12_H743ZI board
ArancinoV.menu.pnum.ArancinoV12_H743ZI=ArancinoV12 H743ZI
ArancinoV.menu.pnum.ArancinoV12_H743ZI.node=NODE_H743ZI
ArancinoV.menu.pnum.ArancinoV12_H743ZI.upload.maximum_size=2097152
ArancinoV.menu.pnum.ArancinoV12_H743ZI.upload.maximum_data_size=524288
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.mcu=cortex-m7
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.board=ArancinoV12_H743ZI
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.series=STM32H7xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.product_line=STM32H743xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.variant=STM32H7xx/ArancinoV12
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.variant_h=variant_ArancinoV12_H743ZI.h
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math

ArancinoV.menu.pnum.ArancinoV12_H743ZI2=ArancinoV12 H743ZI2
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.node="NODE_H743ZI,NOD_H743ZI2"
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.upload.maximum_size=2097152
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.upload.maximum_data_size=524288
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.upload.use_1200bps_touch=true
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.upload.wait_for_upload_port=false
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.mcu=cortex-m7
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.board=ArancinoV12_H743ZI2
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.series=STM32H7xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.product_line=STM32H743xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.variant=STM32H7xx/ArancinoV12
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.variant_h=variant_ArancinoV12_H743ZI.h
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.cmsis_lib_gcc=arm_cortexM7lfsp_math

# ArancinoV12_H743ZI board
ArancinoV.menu.pnum.ArancinoV12_H743ZI=ArancinoV12 H743ZI
ArancinoV.menu.pnum.ArancinoV12_H743ZI.node=NODE_H743ZI
ArancinoV.menu.pnum.ArancinoV12_H743ZI.upload.maximum_size=2097152
ArancinoV.menu.pnum.ArancinoV12_H743ZI.upload.maximum_data_size=524288
ArancinoV.menu.pnum.ArancinoV12_H743ZI.upload.use_1200bps_touch=true
ArancinoV.menu.pnum.ArancinoV12_H743ZI.upload.wait_for_upload_port=false
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.mcu=cortex-m7
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.board=ArancinoV12_H743ZI
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.series=STM32H7xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.product_line=STM32H743xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.variant=STM32H7xx/ArancinoV12
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.variant_h=variant_ArancinoV12_H743ZI.h
ArancinoV.menu.pnum.ArancinoV12_H743ZI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math

ArancinoV.menu.pnum.ArancinoV12_H743ZI2=ArancinoV12 H743ZI2
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.node="NODE_H743ZI,NOD_H743ZI2"
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.upload.maximum_size=2097152
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.upload.maximum_data_size=524288
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.mcu=cortex-m7
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.board=ArancinoV12_H743ZI2
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.series=STM32H7xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.product_line=STM32H743xx
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.variant=STM32H7xx/ArancinoV12
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.variant_h=variant_ArancinoV12_H743ZI.h
ArancinoV.menu.pnum.ArancinoV12_H743ZI2.build.cmsis_lib_gcc=arm_cortexM7lfsp_math

# Serialx activation
ArancinoV.menu.xserial.generic=Enabled (generic 'Serial')
ArancinoV.menu.xserial.generic=Enabled (generic 'Serial')
ArancinoV.menu.xserial.none=Enabled (no generic 'Serial')
ArancinoV.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
ArancinoV.menu.xserial.disabled=Disabled (No Serial support)
ArancinoV.menu.xserial.disabled.build.xSerial=

# USB connectivity

ArancinoV.menu.usb.none=None
ArancinoV.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
ArancinoV.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
ArancinoV.menu.usb.CDC=CDC (no generic 'Serial')
ArancinoV.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
ArancinoV.menu.usb.HID=HID (keyboard and mouse)
ArancinoV.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
ArancinoV.menu.xusb.FS=Low/Full Speed
ArancinoV.menu.xusb.HS=High Speed
ArancinoV.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
ArancinoV.menu.xusb.HSFS=High Speed in Full Speed mode
ArancinoV.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations


ArancinoV.menu.opt.osstd=Smallest (-Os default)
ArancinoV.menu.opt.oslto=Smallest (-Os) with LTO
ArancinoV.menu.opt.oslto.build.flags.optimize=-Os -flto
ArancinoV.menu.opt.o1std=Fast (-O1)
ArancinoV.menu.opt.o1std.build.flags.optimize=-O1
ArancinoV.menu.opt.o1lto=Fast (-O1) with LTO
ArancinoV.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ArancinoV.menu.opt.o2std=Faster (-O2)
ArancinoV.menu.opt.o2std.build.flags.optimize=-O2
ArancinoV.menu.opt.o2lto=Faster (-O2) with LTO
ArancinoV.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ArancinoV.menu.opt.o3std=Fastest (-O3)
ArancinoV.menu.opt.o3std.build.flags.optimize=-O3
ArancinoV.menu.opt.o3lto=Fastest (-O3) with LTO
ArancinoV.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ArancinoV.menu.opt.ogstd=Debug (-g)
ArancinoV.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library

ArancinoV.menu.rtlib.nano=Newlib Nano (default)
ArancinoV.menu.rtlib.nanofp=Newlib Nano + Float Printf
ArancinoV.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
ArancinoV.menu.rtlib.nanofs=Newlib Nano + Float Scanf
ArancinoV.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
ArancinoV.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
ArancinoV.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
ArancinoV.menu.rtlib.full=Newlib Standard
ArancinoV.menu.rtlib.full.build.flags.ldspecs=


# Upload menu
ArancinoV.menu.upload_method.MassStorage=Mass Storage
ArancinoV.menu.upload_method.MassStorage.upload.protocol=
ArancinoV.menu.upload_method.MassStorage.upload.tool=massStorageCopy

ArancinoV.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ArancinoV.menu.upload_method.swdMethod.upload.protocol=0
ArancinoV.menu.upload_method.swdMethod.upload.options=-g
ArancinoV.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ArancinoV.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ArancinoV.menu.upload_method.serialMethod.upload.protocol=1
ArancinoV.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
ArancinoV.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ArancinoV.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ArancinoV.menu.upload_method.dfuMethod.upload.protocol=2
ArancinoV.menu.upload_method.dfuMethod.upload.options=-g
ArancinoV.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

ArancinoV.menu.upload_method.dfuMethod=SmartMeUpload (DFU)
#ArancinoV.menu.upload_method.dfuMethod.use_1200bps_touch=true
ArancinoV.menu.upload_method.dfuMethod.upload.protocol=3
ArancinoV.menu.upload_method.dfuMethod.upload.options=-f
ArancinoV.menu.upload_method.dfuMethod.upload.options.verbose=-v
ArancinoV.menu.upload_method.dfuMethod.upload.tool=arduinoSTM32load
################################################################################

